In [13]:
import pandas as pd

In [14]:
bond = pd.read_csv(r'D:\Learning & Projects\Python\Pandas\Boris\jamesbond.csv')

In [15]:
bond.set_index(keys = 'Film', inplace= True)

In [18]:
bond.reset_index(inplace=True)

In [20]:
bond.set_index(keys = 'Film', inplace= True)

In [21]:
bond.reset_index(inplace=True)
bond.set_index(keys = 'Year', inplace= True)

In [35]:
bond.loc['1967']

,Film,Actor,Director,Box Office,Budget,Bond Actor Salary
Year,,,,,,
1967,Casino Royale,David Niven,Ken Hughes,315.0,85.0,NaN
1967,You Only Live Twice,Sean Connery,Lewis Gilbert,514.2,59.9,4.4

In [36]:
bond.loc['1967':'1977']

,Film,Actor,Director,Box Office,Budget,Bond Actor Salary
Year,,,,,,
1967,Casino Royale,David Niven,Ken Hughes,315.0,85.0,NaN
1967,You Only Live Twice,Sean Connery,Lewis Gilbert,514.2,59.9,4.4
1969,On Her Majesty's Secret Service,George Lazenby,Peter R. Hunt,291.5,37.3,0.6
1971,Diamonds Are Forever,Sean Connery,Guy Hamilton,442.5,34.7,5.8
1973,Live and Let Die,Roger Moore,Guy Hamilton,460.3,30.8,NaN
1974,The Man with the Golden Gun,Roger Moore,Guy Hamilton,334.0,27.7,NaN
1977,The Spy Who Loved Me,Roger Moore,Lewis Gilbert,533.0,45.1,NaN

In [37]:
bond.loc['1967':'1977':3]

,Film,Actor,Director,Box Office,Budget,Bond Actor Salary
Year,,,,,,
1967,Casino Royale,David Niven,Ken Hughes,315.0,85.0,NaN
1971,Diamonds Are Forever,Sean Connery,Guy Hamilton,442.5,34.7,5.8
1977,The Spy Who Loved Me,Roger Moore,Lewis Gilbert,533.0,45.1,NaN

In [56]:
bond.loc[2:5, ['Director', 'Actor']]

        Director         Actor
2   Guy Hamilton  Sean Connery
3  Terence Young  Sean Connery
4     Ken Hughes   David Niven
5  Lewis Gilbert  Sean Connery

In [41]:
bond.loc[['2006', '1967']]

,Film,Actor,Director,Box Office,Budget,Bond Actor Salary
Year,,,,,,
2006,Casino Royale,Daniel Craig,Martin Campbell,581.5,145.3,3.3
1967,Casino Royale,David Niven,Ken Hughes,315.0,85.0,NaN
1967,You Only Live Twice,Sean Connery,Lewis Gilbert,514.2,59.9,4.4

In [51]:
bond = pd.read_csv(r'D:\Learning & Projects\Python\Pandas\Boris\jamesbond.csv')
bond.iloc[1:7, :3]

                              Film  Year           Actor
1            From Russia with Love  1963    Sean Connery
2                       Goldfinger  1964    Sean Connery
3                      Thunderball  1965    Sean Connery
4                    Casino Royale  1967     David Niven
5              You Only Live Twice  1967    Sean Connery
6  On Her Majesty's Secret Service  1969  George Lazenby